/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "Застосування NUIStyleSheet.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "Застосування SAP Mobile Services LogSettings.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "Автентифікація не вдалася!";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "Перевірка реєстраційних даних.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "Ви дійсно бажаєте скасувати процес інтеграції нових працівників?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "Ви дійсно бажаєте скасувати процес відновлення?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "Ви дійсно бажаєте скасувати процес скидання коду доступу?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "Ви дійсно бажаєте скасувати процес автентифікації?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "Ви дійсно бажаєте скинути код доступу?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "Ви дійсно бажаєте скасувати процес зміни коду доступу?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "Ви дійсно бажаєте скинути свій застосунок?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "Складені кроки.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "Завантаження SAP Mobile Services ClientResources.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "Завантаження місць призначення SAP Mobile Services.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "Завантаження настройок SAP Mobile Services.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "Продовжити";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "Продовжити";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "Активувати";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "Активувати";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "Наступного разу для входу використайте код доступу.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "Face ID стане недоступним.";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "Зміни політики";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "Наступного разу для входу використайте код доступу.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "Touch ID стане недоступним.";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "Зміни політики";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "Ви можете у будь-який час увімкнути чи вимкнути цю функцію в Настройках.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Тепер Face ID доступний! Активація цієї функції надасть вам швидший доступ до вашої інформації.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Face ID";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "Ви можете у будь-який час увімкнути чи вимкнути цю функцію в Настройках.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Тепер Touch ID доступний! Активація цієї функції надасть вам швидший доступ до вашої інформації.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Touch ID";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "Продовжити";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "Створіть новий код доступу.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "Політика використання кодів доступу змінена";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "Зміни політики";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "Відтепер код доступу й Face ID для входу більше не потрібні. \n\n Ви будете входити у застосунок напряму.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "Відтепер код доступу й Touch ID для входу більше не потрібні. \n\n Ви будете входити у застосунок напряму.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "OK";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "Відтепер код доступу для входу більше не потрібний. \n\n Ви будете входити у застосунок напряму.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "Політика входу змінена";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "Сповіщення";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "Продовжити";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "Починаючи з цієї версії код доступу є обов'язковим. Створіть код доступу для застосунку.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "Код доступу є обов'язковим.";

/* XBUT: Text of No button. */
"noButtonText" = "Ні";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "Перевірка реєстраційних даних OAuth 2.0.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "Для активації Face ID введіть код доступу:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "Для активації Touch ID введіть код доступу:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "Без дозволу ви не зможете продовжити інтеграцію нових працівників.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "Надати дозвіл";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "Вийти з процесу";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "Перевірка реєстраційних даних SAML";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "Перевірка реєстраційних даних SAP Mobile Services UserIdentity Discovery.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "Перевірка реєстраційних даних SLS";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "Заповніть всі поля";

/* XBUT: Text of Yes button. */
"yesButtonText" = "Так";

/* XBUT: Text of Continue button. */
"continueButtonText" = "Продовжити";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "Скасувати";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "Збирання даних використання";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "Адміністратор застосунку вимагає вашої згоди на збирання даних про вас з використанням застосунку з метою отримання аналітичних висновків, необхідних для покращення застосунку. Збір даних включає інформацію про те, як ви використовуєте застосунок, наприклад, час роботи із застосунком або характер навігації у застосунку.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "Ви бажаєте відмовитися?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "Ви бажаєте надати згоду?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "Збирання звітів про аварійне завершення роботи";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "Адміністратор застосунку вимагає вашого дозволу на збирання даних з метою діагностики та аналізу аварійних завершень роботи для покращення стабільності застосунку. Зібрані дані обмежені звітами про аварійне завершення роботи та інформацією про пристрій.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "Помилка!";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "Помилка перевірки підпису QR-коду!";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "Цифровий підпис QR-коду перевірено. Ви будете з'єднані з:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "Помилка автентифікації";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "Нам не вдалося виконати вашу автентифікацію. Увійдіть у систему.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "Помилка";

